<h1><b> Pandas </b> </h1>

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d= {'a':10, 'b':20, 'c':30}

In [4]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data = my_data, index= labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
type(d)

dict

In [9]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])

In [10]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser2 = pd.Series ([1,2,5,4], ['USA', 'Germany', 'Italy', 'Japan'])

In [12]:
ser1['USA']

1

In [13]:
ser1['USA'] + ser2['USA']

2

In [14]:
ser1['USA'] == ser2['USA']

True

In [15]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

<h2><b>Pandas Dataframe</b></h2>

In [16]:
from numpy.random import randn

In [17]:
np.random.seed(101)

In [18]:
df = pd.DataFrame(randn(5,4),['A','B','C','D', 'E'],['W','X','Y','Z'])

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [21]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [22]:
df['new'] = df['W'] + df['Y']

In [23]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [24]:
df.drop('new', axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Conditional selection

In [25]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [26]:
df[df['Z']<0 ]

          W         X         Y         Z       new
C -2.018168  0.740122  0.528813 -0.589001 -1.489355

In [27]:
boolser = df['W']>0

In [28]:
result = df[boolser]

In [29]:
boolser

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [30]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  3.614819
1     B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
2     C -2.018168  0.740122  0.528813 -0.589001 -1.489355
3     D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
4     E  0.190794  1.978757  2.605967  0.683509  2.796762

In [31]:
newind = 'ca ny wy or co'.split()

In [32]:
newind

['ca', 'ny', 'wy', 'or', 'co']

In [33]:
df['State'] = newind

In [34]:
df

          W         X         Y         Z       new State
A  2.706850  0.628133  0.907969  0.503826  3.614819    ca
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959    ny
C -2.018168  0.740122  0.528813 -0.589001 -1.489355    wy
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542    or
E  0.190794  1.978757  2.605967  0.683509  2.796762    co

# Multi Indexing and Index Hierachy

In [35]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [36]:
df= pd.DataFrame(randn(6,2), hier_index,['A','B'])

In [37]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [38]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [39]:
#Rename the index
df.index.names = ['Groups', 'Num']

In [40]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [41]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

# Missing Data

In [42]:
# Create Dataframe
d = {'A': [1,2,np.nan], 'B': [5, np.nan, np.nan], 'C': [1,2,3]}

In [43]:
df = pd.DataFrame(d)

In [44]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [45]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [46]:
#You can set a threshold for missingness using the thresh paremeter
df.dropna(thresh=2)
#what the above code does is to drop every row with missing values of more then 2

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [47]:
#We can also replace the na values using fillna method
df.fillna(value= 'FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [48]:
# you could also fill null with the mean of a particular column i.e mean inputation
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

<h1>Groupby</h1>

Groupby allows you yo group together rows based off a column and perfrom an aggregate function

In [49]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [50]:
df = pd.DataFrame(data)

In [51]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [52]:
bycomp= df.groupby('Company')

In [53]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [54]:
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [55]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [56]:
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [57]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [58]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [59]:
df.groupby('Company').Sales.mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

<h1> Operations </h1>

In [60]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [61]:
# Check number of unique values
df['col2'].nunique()

3

In [62]:
#Check number of times each unique value occured
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [63]:
#Conditional selection
#Code below retunrs all rows in which the value of col1 is greater then 2
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [64]:
#One can also include multiple conditions using the ampersand sign(&) or the pipe (|)
df[(df['col1']>2) & (df['col2']== 444)]

   col1  col2 col3
3     4   444  xyz

<h2> apply method </h2>
This lets you apply your own custom function or inbuilt functions

In [65]:
#Say we have the following function
def times2(x):
    return x*2

In [66]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [67]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

---

In [69]:
#Sort by a particular column
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [70]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

#Pivot

In [73]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [74]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [75]:
df.pivot_table(values = 'D', index =['A', 'B'], columns =['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN